package week1.hw1;

/**
 * Напишите программу, выводящую в консоль It's alive! It's alive!
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("It's alive! It's alive!");
    }
}
